Experimental/NREL6_Wind_Turbine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object blockMeshDict;
}

convertToMeters 1;

vertices  
(
  (-10.0 -10.0 -10.00)
  ( 10.0 -10.0 -10.00)
  (-10.0  10.0 -10.00)
  ( 10.0  10.0 -10.00)
  (-10.0 -10.0  10.00)
  ( 10.0 -10.0  10.00)
  (-10.0  10.0  10.00)
  ( 10.0  10.0  10.00)
);

blocks  
(
    hex ( 0 1 3 2 4 5 7 6) (1 1 1) simpleGrading (1 1 1)
);

edges  
(
);

boundary
( 

  inlet
  {
      type patch;
      faces 
      (
          (0 2 6 4)
      );
  } 
  
  sides
  {
      type patch;
      faces 
      (
          (0 1 5 4)
          (2 3 7 6)
          (0 1 3 2)
          (4 6 7 5)
      );
  } 
  
  outlet
  {
      type patch;
      faces 
      (
          (1 3 7 5)
      );
  } 

);

mergePatchPairs  
(
);
