Experimental/NREL6_Wind_Turbine/system/topoSetDict
/*--------------------------------*- C++ -*---------------------------------*\
| ========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    allcells;
        type    cellSet;
        action  clear;
    }
    {
        name    allcells;
        type    cellSet;
        action  invert;
    }
    {
        name    region0;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set allcells;
        }
    }

);
